Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Function Reference
fr: Référence UDF

source: Transform a 1D array to Histogram
fr: Transforme un tableau 1D en histogramme

source: Parameters
fr: Paramètres

source: Array to transform
fr: Tableau à transformer

source: [optional]
fr: [optionnel]

source: Allows to zoom the histogram.
fr: Permet de modifier l'échelle de l'histogramme.

source: Default = 100 percent
fr: Par défaut, 100%.

source: Return Value
fr: Valeur de retour

source: the array transformed.
fr: Retourne un tableau contenant les données de l'histogramme.

source: sets the @error flag to non-zero.
fr: Retourne @error <> 0.

source: 1 - $aArray is not a 1D array
fr: 1 - $aArray n'est pas un tableau 1D

source: Remarks
fr: Remarque

source: Right alignment of negative values is not perfect due to non fixed font usage.
fr: L'alignement à droite des valeurs négatives n'est pas parfaite en raison de l'utilisation des polices non fixes.

source: Related
fr: Lien

source: None.
fr: Aucun.

source: Example
fr: Exemples

source: Example 1
fr: Exemple 1

source: Example 2
fr: Exemple 2

source: Adds a specified value at the end of an existing 1D or 2D array
fr: Ajoute une valeur spécifiée à la fin d'un tableau existant 1D ou 2D

source: Array to modify
fr: Tableau à modifier

source: Value(s) to add - can be a single item, a delimited string or an array
fr: Valeur(s) à insérer qui peut être un élément simple, une chaîne morcellée (avec séparateurs) ou un tableau

source: Column in which addition is to begin (2D array only)
fr: Colonne où l'insertion commence (tableau 2D seulement)

source: Delimiter used if a string is to be split into items
fr: Séparateur à utiliser si une chaîne doit être éclatée en morceaux

source: Delimiter used if a string is to be split into rows (2D only)
fr: Séparateur à utiliser si une chaîne doit être éclatée en lignes de tableau (tableau 2D seulement)

source: [optional]Variable to which a datatype function (e.g.
fr: [optionne] Variable assignée avec une fonction 'type de données' (par exemple Number, HWnd).

source: Number, HWnd) has been assigned.If $vValue is a delimited string, forces items into that datatype.
fr: Si $vValue est une chaîne morcellée, force les morceaux dans ce type de données.

source: the index of last added item.
fr: Retourne l'index du dernier élément inséré

source: -1 and sets the @error flag to non-zero.
fr: Retourne -1 et @error non nul

source: 1 - $aArray is not an array
fr: 1 - $aArray n'est pas un tableau

source: 2 - $aArray is not a 1 or 2 dimensional array
fr: 2 - $aArray n'est pas un tableau de dimension 1 ou 2

source: 3 - $vValue has too many columns to fit into $aArray
fr: 3 - $vValue a trop de colonnes pour s'adapter à $aArray

source: 4 - $iStart outside array bounds (2D only)
fr: 4 - $iStart est en dehors des limites du tableau (2D seulement)

source: 5 - Number of dimensions for $avArray and $vValue arrays do not match
fr: 5 - Le nombre de dimensions des tableaux $aArray et $vValue ne correspondent pas

source: If $vValue is a delimited string all items are added to the array as strings.
fr: Si $vValeur est une chaîne morcellée, tous les morceaux sont insérés au tableau sous forme de chaînes.

source: This can be over-ridden by using the $hDataType parameter which forces the items into the required datatype.
fr: Ce comportement peut être modifié en utilisant le paramètre $hDataType qui force les éléments dans le type de données requis.

source: Note that all items in the delimited string are converted - if the items are of different datatypes then they must be passed as an array so that their specific datatype is conserved.
fr: Notez que tous les morceaux de la chaîne morcellée sont convertis - si les morceaux sont de types différents, ils doivent être transmis comme un tableau, de sorte que leur type de données spécifiques soit conservé.

source: Addition mode depends on $vValue type:
fr: Le mode d'insertion dépend du type de $vValeur:

source: 1D arrays:
fr: Tableaux 1D:

source: Single item - adds 1 element
fr: Elément unique - insère un élément

source: $sDelim_Item delimited string - adds as many elements as items
fr: $sDelim_Item: chaîne morcellée - insère autant d'éléments que de morceaux

source: 0-based 1D array - adds as many elements as items
fr: Tableau 1D de base 0 - insére autant d'éléments qu'il y a d'éléments dans le tableau

source: 2D arrays:
fr: Tableaux 2D:

source: $sDelim_Item delimited string - adds 1 row, columns filled if enough items
fr: $sDelim_Item: chaîne morcellée - insère une ligne, les colonnes sont remplies si il y a assez de morceaux

source: $sDelim_Row delimited string - adds as many rows as items, only 1 column filled
fr: $sDelim_Row: chaîne morcellée - insère autant de lignes que de morceaux, une seule colonne est remplie

source: $sDelim_Item & Row delimited string - adds rows and items, depending on split points
fr: $sDelim_Item & Row: chaîne morcellée - insère des lignes et des éléments, selon les morceaux

source: 0-based 2D array - adds as many rows/columns as in array
fr: Tableau 2D de base 0 - insère autant de lignes/colonnes que dans le tableau

source: An empty string ("") is added if there are insufficient items specified in $vValue.
fr: Une chaîne vide ("") est insérée s'il n'y a pas suffisamment d'éléments spécifiés dans $vValeur.

source: Excess items are ignored.
fr: Les éléments en excès sont ignorés.

source: Add a single item
fr: Insère un élément unique

source: Add a delimited string - each item adds new element
fr: Insère une chaîne avec délimiteurs - chaque item insère un nouvel élément

source: Add a 1D array - each element adds new element
fr: Insère un tableau 1D - chaque item insère un nouvel élément

source: Add item delimited string
fr: Insère les items de la chaîne avec séparateurs

source: Add row delimited string - load in col 1
fr: Insère une ligne à partir d'un chaîne avec séparateurs - chargé dans la colonne 1

source: Add item & row delimited string
fr: Insère item & ligne à partir d'une chaîne avec délimiteurs

source: Add a 2D array
fr: Insère un tableau 2D

source: Add a 2D array - Single item/column - load in col 1
fr: Insère un tableau 2D - un seul item/colonne - chargé dans la colonne 1

source: Example 3
fr: Exemple 3

source: Note added as number datatype here
fr: Inséré en tant que type de données Number ici

source: Add items by delimited string
fr: Insère des items à partir d'une chaîne délimitée

source: But converted to string datatype here
fr: Mais converti en type de données chaîne ici

source: Now force datatype to be retained
fr: Maintenant force le type de données à conserver

source: And datatype is retained
fr: Et le type de données est conservé

source: Deletes a specified column from a 2D array
fr: Supprime une colonne spécifiée d'un tableau 2D

source: Column to delete
fr: Colonne à supprimer

source: If True then if only one column remains the array is converted to 1D
fr: Si True, alors si une seule colonne reste, le tableau est converti en 1D

source: the number of columns remaining.
fr: Retourne le nombre de colonnes restantes.

source: 2 - $aArray is not a 2D array
fr: 2 - $aArray n'est pas un tableau 2D

source: 3 - $iColumn is outside array bounds
fr: 3 - $iColumn est en dehors des limites du tableau

source: Copy 2 col array
fr: Copie 2 colonnes du tableau

source: Default 1 column left as 2D array
fr: Par défaut 1 colonne à gauche comme tableau 2D

source: Convert 1 column array to 1D
fr: Convertit une colonne de tableau en 1D

source: Inserts a specified column into a 1D or 2D array
fr: Insère une colonne spécifiée dans un tableau 1D ou 2D

source: Column to insert - if array is 1D it is automatically converted to 2D
fr: Colonne à insérer - si le tableau est 1D, il est automatiquement converti en 2D

source: 2 - $aArray is not a 1D or 2D array
fr: 2 - $aArray n'est pas un tableau 1D ou 2D

source: 3 - $iColumn is less than 0 or greater than upper array bound plus 1
fr: 3 - $iColumn est inférieure à 0 ou supérieure à la limite supérieure plus 1

source: Now a 2D array
fr: Maintenant un tableau 2D

source: Concatenate two arrays - either 1D or 2D with the same number of columns
fr: Concaténe deux tableaux - tous les deux 1D ou 2D avec le même nombre de colonnes

source: The array to which the source array will be concatenated
fr: Le tableau auquel le tableau source sera concaténé

source: The array to concatenate to the target array
fr: Le tableau source à concaténer au tableau cible

source: index of the first Source array entry (Default = 0)
fr: Index de la première entrée du tableau source (par défaut, 0)

source: the number of elemets/rows in the new target array
fr: Retourne le nombre d'élémets/lignes du nouveau tableau cible

source: 1 - $aArrayTarget is not an array
fr: 1 - $aArrayTarget n'est pas un tableau

source: 2 - $aArraySource is not an array
fr: 2 - $aArraySource n'est pas un tableau

source: 3 - $aArrayTarget is not a 1D or 2D array
fr: 3 - $aArrayTarget n'est pas un tableau 1D ou 2D

source: 4 - $aArrayTarget and $aArraySource 1D/2D mismatch
fr: 4 - $aArrayTarget et $aArraySource 1D/2D ne correspondent pas

source: 5 - $aArrayTarget and $aArraySource column number mismatch (2D only)
fr: 5 - $aArrayTarget et $aArraySource ont des nombres de colonne différents (2D uniquement)

source: 6 - $iStart outside array bounds
fr: 6 - $istart est hors des limites du tableau

source: The $iStart parameter is useful when concatenating arrays which have a count in the [0] element.
fr: Le paramètre $iStart est utile lors de la concaténation des tableaux qui ont le nombre d'éléments à la position [0].

source: Deletes the specified element(s) from the specified 1D or 2D array
fr: Supprime les éléments spécifiés dans un tableau 1D ou 2D

source: Element(s) to delete - either a single index, a range string or a 1D array with a count in the [0] element (see example for details)
fr: Élément(s) à supprimer - soit un index unique, une chaîne contenant des plages (exemple "0;11-15;24") soit un tableau 1D avec le nombre d'éléments en position [0] (voir l'exemple pour plus de détails)

source: the new size of the array (see remarks)
fr: Retourne la nouvelle taille du tableau (voir Remarques)

source: 3 - $vRange is not a valid range string
fr: 3 - $vRange n'est pas une chaîne de plage valide

source: 4 - $vRange is not a 1D array or has only 1 element
fr: 4 - $vRange n'est pas un tableau 1D ou a seulement 1 élément

source: 5 - $vRange content is outside array bounds
fr: 5 - $vRange a un contenu en dehors des limites du tableau

source: $vRange can be a string containing the rows which are to be deleted.
fr: $vRange peut être une chaîne contenant les lignes qui doivent être supprimés.

source: It can be a single number or a range denoted by the first and last lines separated by a hyphen (-) - multiple items are separated by a semi-colon (;).
fr: Il peut être un nombre unique ou une plage désignée par les première et dernière lignes séparées par un tiret (-) - plusieurs plages sont séparés par un point-virgule (;).

source: $vRange can also be a 1D array listing all rows to be deleted with the count in the [0] element].
fr: $vRange peut aussi être un tableau 1D énumérant toutes les lignes à supprimer avec un compteur dans l'élément [0].

source: In either case, the rows need not be in ascending order and can be duplicated.
fr: Dans les deux cas, les lignes ne sont pas nécessairement dans l'ordre croissant et peuvent être dupliqués.

source: Single row
fr: Ligne unique

source: Range string
fr: Chaîne contenant des plages

source: 1D array
fr: Tableau 1D

source: Displays a 1D or 2D array in a ListView
fr: Affiche un tableau 1D ou 2D dans un contrôle ListView

source: Array to display
fr: Tableau à afficher

source: Title for dialog.
fr: Titre de l'affichage.

source: Default = "ArrayDisplay".
fr: Par défaut ="ArrayDisplay ".

source: Range of rows/columns to display.
fr: Plage de lignes/colonnes à afficher.

source: Default = entire array.
fr: Par défaut, le tableau entier.

source: (See below for details)
fr: (Voir ci-dessous pour plus de détails)

source: Determine UDF options.
fr: Déterminer les options UDF.

source: Add required values together - default = 0
fr: Ajouter les valeurs requises ensemble - par défaut = 0

source: 1 - Transposes the array
fr: 1 - Transpose le tableau

source: 2 (right) or 4 (center) - Column text alignment (default = left)
fr: 2 (à droite) ou 4 (centré) - alignement du texte dans les colonnes (par défaut = à gauche)

source: 8 - Verbose = display MsgBox on error and splash screens during processing of large arrays
fr: 8 - verbose = affiche MsgBox si erreur et recouvre l'écran pour de grands tableaux

source: 16 - Only 'Copy' buttons displayed
fr: 16 - Seul le bouton 'copy' s'affiche

source: 32 - No buttons displayed
fr: 32 - Aucun bouton s'affiche

source: 64 - No 'Row' column displayed
fr: 64 - Aucune colonne 'Row' s'affiche

source: Sets column display option when copying data to clipboard.
fr: Définit l'option d'affichage des colonnes lors de la copie des données du presse-papiers.

source: Character = Delimiter between columns.
fr: Caractère = Séparateur entre les colonnes.

source: Number = Fixed column width - longer items will be truncated.
fr: Nombre = fixe la largeur des colonnes - les éléments plus longs seront tronqués.

source: Default = Current separator character (usually "|").
fr: Par défaut = séparateur courant (généralement "|").

source: Column names in header (string of names separated by current separator character - usually "|").
fr: Les noms de colonnes d'entête (chaîne de noms séparés par le séparateur courant - en général "|" ).

source: Default see Remarks.
fr: Par défaut voir Remarques.

source: Max width to which a ListView column will expand to show content.
fr: Largeur maximale à laquelle une colonne de ListView s'élargit pour afficher le contenu.

source: Default = 350 pixels.
fr: Valeur par défaut = 350 pixels.

source: ListView alternate rows set to defined color.
fr: Couleur à utiliser une ligne sur deux sur les lignes de ListView.

source: Default = all rows ListView background color.
fr: Par défaut = toutes les lignes de ListView ont la couleur de fond.

source: A variable assigned to the user defined function to run.
fr: Une variable affectée avec la fonction utilisateur à exécuter.

source: Default = none.
fr: Par défaut = Aucun.

source: See remarks.
fr: Voir les remarques.

source: 0 and @error flag set as follows:
fr: Retourne 0 et @error non nul:

source: 2 - $aArray has too many dimensions (only 1D and 2D supported)
fr: 2 - $aArray a trop de dimensions (seulement 1D et 2D est supporté)

source: If the function is passed a non-array variable or an array of more than 2 dimensions the function returns an error and the script continues.
fr: Si le paramètre $aArray n'est pas un tableau ou est un tableau de plus de 2 dimensions, la fonction renvoie une erreur et le script continue.

source: If the "verbose" parameter is set in $iFlags a MsgBox will be displayed which offers the chance to exit the script immediately or to continue the script with the normal error return.
fr: Si le paramètre "verbose" est installé dans $iFlags un MsgBox s'affiche qui offre la possibilité de quitter immédiatement le script ou de continuer le script avec un retour normal d'erreur.

source: Only 65525 rows of an array can be displayed - this is an AutoIt limitation on the total number of controls that can be displayed in a GUI - and an abitrary display limit of 250 columns has also been set.
fr: Seuls 65 525 lignes d'un tableau peuvent être affichés - il s'agit d'une limitation de AutoIt sur le nombre total de contrôles qui peuvent être affichés dans une GUI - et une limite d'affichage abitrary de 250 colonnes a également été mis.

source: If the user tries to display an array larger than these limits an "*" is added to the truncated dimension value which will be displayed in red text.
fr: Si l'utilisateur tente d'afficher un tableau plus grand que ces limites, une "*" est ajoutée à la valeur de la dimension tronquée qui sera affiché en rouge.

source: Note that using $iArrayRange to determine the elements to be displayed allows arrays larger than the display limits to be displayed in sections.
fr: Notez que l'utilisation de $iArrayRange pour déterminer les éléments à afficher permet des tableaux plus grands que les limites d'affichage le permettraient.

source: The $sArrayRange parameter syntax is as follows:
fr: La syntaxe du paramètre $sArrayRange est la suivante:

source: "7" - Show rows 0-7 with all columns
fr: "7" - Affiche les lignes 0-7 avec toutes les colonnes

source: - Show rows 7-end with all columns
fr: - Affiche les lignes 7-fin avec toutes les colonnes

source: "|7" - Show all rows with columns 0-7
fr: "|7" - Affiche toutes les lignes avec les colonnes 0-7

source: - Show all rows with columns 7-end
fr: - Affiche toutes les lignes avec les colonnes 7-fin

source: "7|7" - Show rows 0-7 with columns 0-7
fr: "7|7" - Affiche les lignes 0-7 avec les colonnes 0-7

source: "5:7" - Show rows 5-7 with all columns
fr: "5:7" - Affiche les lignes 5-7 avec toutes les colonnes

source: "|5:7" - Show all rows with columns 5-7
fr: "|5:7" - Affiche toutes les lignes avec les colonnes 5-7

source: "7|5:7" - Show rows 0-7 with columns 5-7
fr: "7|5:7" - Affiche les lignes 0-7 avec les colonnes 5-7

source: "5:7|7" - Show rows 5-7 with columns 0-7
fr: "5:7|7" - Affiche les lignes 5-7 avec les colonnes 0-7

source: "5:7|5:7" - Show rows 5-7 with columns 5-7
fr: "5:7|5:7" - Affiche les lignes 5-7 avec les colonnes 5-7

source: Any column values are ignored for 1D arrays.
fr: Toutes les valeurs de colonnes sont ignorées pour les tableaux 1D.

source: $sHeader names (separated by the current separator character) will be used for as many columns as there are names.
fr: Les noms $sHeader (séparés par le séparateur courant) seront utilisés pour autant de colonnes qu'il y a de noms.

source: If no, or not enough, custom names are specified then the default header of "Row|Col0" for 1D arrays or "Row|Col0|Col1|...|Col n" for 2D is substituted.
fr: S'il n'y a pas de nom, ou pas assez, les noms suivants pour les entêtes seront utilisés:"Row|Col0" pour les tableaux 1D, ou "Row|Col0|Col1|...|Col n" pour les tableaux 2D.

source: The 4 buttons at the bottom of the dialog have the following functions:
fr: Les 4 boutons en bas de la boîte de dialogue ont les fonctions suivantes :

source: - Copy Data & Hdr/Row - copy the array or the selected row(s) to the clipboard adding full header and row identification.
fr: - Copy Data & Hdr/Row - copie le tableau ou les lignes sélectionnées dans le presse-papier en ajoutant l'entête complet et l'identification des lignes.

source: - Copy Data Only - copy the array or the selected row(s) to the clipboard with no header or row identification.
fr: - Data Copy Only - copie le tableau ou les lignes sélectionnées dans le presse-papier sans en-tête ou identification de ligne.

source: - Run User Func - run the user-defined function passed in $sUser_Function.
fr: - Run User Func - exécute la fonction utilisateur passé dans $sUser_Function.

source: This function is entirely separate from the UDF and must be created and coded by the user to accept 2 parameters: the full array and a 1D array holding the selected rows indices with a count in the [0] element.
fr: Cette fonction est entièrement distincte de l'UDF et doit être créée et codée par l'utilisateur pour accepter deux paramètres: le tableau complet et un tableau 1D contenant les indices des lignes sélectionnées avec un compteur dans l'élément [0].

source: The button is not displayed if no function is specified.
fr: Le bouton ne s'affiche pas si aucune fonction n'est spécifiée.

source: - Exit script - Exit the script immediately.
fr: - Exit script - Sort du script immédiatement.

source: The $iFlags parameter enables some or all of these buttons to be hidden.
fr: Le paramètre $iFlags permet de cacher tout ou partie de ces boutons.

source: If all buttons are displayed the array dimensions are displayed at lower left.
fr: Si tous les boutons sont affichés les dimensions du tableau sont affichées en bas à gauche.

source: They are in red text if any the following occur: row/column truncation, array transposition, or displaying only a range of elements - a tooltip displays the particular occurence(s).
fr: Ils sont en rouge si tout ce qui suit se produit: ligne/colonne tronquée, tableau transposé, ou affichage uniquement d'une plage d'éléments - une info-bulle affiche les occurrences particulières.

source: If the "verbose" parameter is set in $iFlags a splash dialog is displayed during initial processing when the array to display has more than 10000 elements.
fr: Si le paramètre "verbose" est installé dans $iFlags une boîte de dialogue 'splash' est affichée pendant le traitement initial lorsque le tableau d'affichage a plus de 10000 éléments.

source: A similar dialog is displayed when the "Copy Data" buttons are used on a 10000+ element display - in this is likely to occur consideration should be given to using a "User Function" to store the array for later processing.
fr: Une boîte de dialogue similaire s'affiche lorsque les boutons "Copy Data" sont utilisées sur plus de 10000 éléments affichés - si cela est susceptible de se produire, il faudrait envisager d'utiliser une "fonction utilisateur" pour stocker le tableau pour un traitement ultérieur.

source: Create 1D array to display
fr: Crée un tableau 1D à afficher

source: No buttons displayed
fr: Pas de boutons affichés

source: Create 2D array to display
fr: Crée un tableau 2D à afficher

source: Note columns truncated
fr: Notez les colonnes tronquées

source: Note all array elements displayed
fr: Notez tous les éléments du tableau affichées

source: Assign the user function to a variable to pass as a parameter
fr: Assigne la fonction utilisateur à une variable pour la passer en paramètre

source: Note no col names as transposed
fr: Notez qu'aucun nom de col n'a été transposé

source: Create non-array variable to force error - MsgBox displayed as $iFlags set
fr: Créé une variable non tableau pour forcer une erreur - MsgBox s'affiche car $iFlags est installé

source: Note that the user function MUST have TWO parameters even if you do not intend to use both of them
fr: Notez que la fonction utilisateur DOIT avoir DEUX paramètres même si vous n'avez pas l'intention d'utiliser les deux

source: But if a parameter is not used do this to prevent an Au3Check warning
fr: Mais si un paramètre n'est pas utilisé, faire ceci pour éviter un avertissement de Au3Check

source: Extracts an array from the specified element(s) of a 1D or 2D array
fr: Extrait un tableau à partir des éléments spécifiés d'un tableau 1D ou 2D

source: Array from which extraction should occur
fr: Tableau à partir de laquelle doit se faire l'extraction

source: First row of the extracted array
fr: Première ligne du tableau extrait

source: Last row of the extracted array
fr: Dernière ligne du tableau extrait

source: First column of the extracted array (2D only)
fr: La première colonne du tableau extrait (2D uniquement )

source: Last row of the extracted array (2D only)
fr: Dernière colonne du tableau extrait (2D uniquement)

source: 3 - $iStart_Row or $iEnd_Row outside array bounds
fr: 3 - $iStart_Row ou $iEnd_Row est en dehors des limites du tableau

source: 4 - $iStart_Row greater then $iEnd_Row
fr: 4 - $iStart_Row est plus grand que $iEnd_Row

source: 5 - $iStart_Col or $iEnd_Col outside array bounds
fr: 5 - $iStart_Col ou $iEnd_Col est en dehors des limites du tableau

source: 6 - $iStart_Col greater then $iEnd_Col
fr: 6 - $iStart_Col est plus grand que $iEnd_Col
